{
	"@metadata": {
		"authors": [
			"Mark A. Hershberger"
		]
	},
	"wikitoldap-desc": "Wiki to LDAP account conversion",
	"wikitoldap-group": "Wiki to LDAP group for account migration",

	"wikitoldap-legend": "Wiki to LDAP",
	"wikitoldap-introduction": "====Your user needs to be merged with an LDAP-backed user.====\n*If you do not yet have an LDAP-backed account, please create one.\n*If you have an LDAP-backed account, and have never used it to log into this wiki, please log out now and log into this wiki with your LDAP-backed account at least once so that the wiki is aware of it.\n*After you have logged into this wiki with your LDAP account, please log in again as your current user.  The wiki will direct you here again so the accounts can be merged.\n*Once the user merge process is complete, you will not be able to use this user to log in, but your LDAP-backed MediaWiki account will have this user's wiki contributions.",
	"wikitoldap-select-account": "LDAP-backed account to use:",
	"wikitoldap-ldap-password": "LDAP password for '<tt>$1</tt>':",
	"wikitoldap-confirm-merge": "====You have successfully authenticated to the LDAP account <tt>$2</tt>.====\nIf you are ready to merge the account you are currently logged into (<tt>$1</tt>) into the LDAP-backed account (<tt>$2</tt>), submit this form.",

	"wikitoldap-invalid-account": "'$1' is not an account on this wiki",
	"wikitoldap-same-user": "'$1' is the same as '$2'",
	"wikitoldap-not-migratable-account": "'$1' is not an LDAP-backed account.  If you think it is, please log to the wiki with it using LDAP first.",
	"wikitoldap-account-problems": "'$1' does not pass validation, please go back a step and try again.",
	"wikitoldap-only-one-domain": "WikiToLDAP currently only works with one LDAP domain.",
	"wikitoldap-invalid-password": "Invalid password, please try again",

	"action-migrate-from-ldap": "migrate your account to an LDAP account",
	"log-name-wikitoldap": "Wiki to LDAP account conversion",
	"log-description-wikitoldap": "These are the logs from any account merging activity.",
	"logentry-wikitoldap-redirect": "$1 {{GENDER:$2|was redirected}} to migrate {{GENDER:$2|his|her|their}} account when accessing $3",

	"migrateuser": "User migration"
}
